"Решенията са писани на R5RS"

"Решете всички задачи, които не сте решили, от тези публикувани на сайта. Помислете в кои от тях е удобно да се използва 
безименна функция. Помислете за алтернативни решения. Ще получавате бонус точки за откриване на грешки в 
публикуваните решения (не за всякакви грешки, като например правописни, но за повечето), както и за оригинални решения."

"Упражнение 1, Задача 10. Да се напише функция, която приема 2 аргумента - число и цифра и връща позицията на първото срещане на цифрата
в числото започвайки броенето отдясно наляво и от 0. Ако цифрата не се среща функцията връща лъжа."

(define (f num dig)
  (define  (g num dig i) 
  (cond ((eqv? (car num) dig) (+ i 1))
        ((not (eqv? (car num) dig)) (g (cdr num) dig (+ i 1)))
       (else (#f))
    ))
  (g (reverse num) dig 0))

(f (list 1 2 5) 2) 
(f (list 1 2 5) 5)
(f (list 1 2 5) 1)
(f (list 1 2 3 4 5 6 7 8 9) 9)
(f (list 1 2 3 4 5 6 7 8 9) 1)

`(Tova e "като решения на това домашно освен гореспоменатите поправки и предложения изпращайте решенията на задачи 10 и 11 от упражнение 3.")

"Упражнение 3, Задача 11"

(define (append2 l1 l2)
  (if (eq? l1 `()) l2
      (cons (car l1) (append2 (cdr l1) l2))))
(append2 (list 1 2 3) (list 2 3 4))  

"Упражнение 3, Задача 10"
 
(define (funk1 l1)
    (cond ((or(= (length l1) 1) (eq? l1 '())) l1)
          
          (funk1 (cons (car (cdr l1)) (cons (car l1) (funk1 (cddr l1)))))))
 

(funk1 (list 1 2 3 4 5 6))
(funk1 (list 1 2 3 4 5))







  
  
  
  
  


